/*
////////////////////////////////////////////////////////////////
//
// 작성자 : 20194024 김민욱
// 작성일 : 2022년 04월 04일
// 프로그램명 : 행렬 뺄셈 프로그램
// 프로그램설명 : 주어진 두 행렬을 더하는 프로그램이다.
//				
//
////////////////////////////////////////////////////////////////

#include <stdio.h>
#include <stdlib.h>
int main() {

	int A_matrix[2][2] = { {1,2},{2,1} };
	int B_matrix[2][2] = { {2,2},{5,6} };
	int C_matrix[2][2] = { 0 };

	for (int i = 0; i < 2; i++) {
		for (int j = 0; j < 2; j++) {
			C_matrix[i][j] = A_matrix[i][j] - B_matrix[i][j];
			printf("%d\t", C_matrix[i][j]);
		}
		printf("\n");
	}

	return 0;

}
*/